#### RasterQualityType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing the options for raster quality.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum RasterQualityType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RasterQualityType ``` |

| Visual C++ |
| --- |
| ``` public enum class RasterQualityType ``` |

# Members

| Member name | Description |
| --- | --- |
| Low | The type of Raster Quality is Low. |
| Medium | The type of Raster Quality is Medium. |
| High | The type of Raster Quality is High. |
| Presentation | The type of Raster Quality is Presentation. |

# See Also

Autodesk.Revit.DB Namespace